OlivierC-FR/ESP32-INAV-Radar/src/main.cpp
//
// ESP32 Radar
// Github : https://github.com/OlivierC-FR/ESP32-INAV-Radar
// RCgroups : https://www.rcgroups.com/forums/showthread.php?3304673-iNav-Radar-ESP32-LoRa-modems
//
// -------------------------------------------------------------------------------------------


#include <Arduino.h>
#include <esp_system.h>
#include <lib/MSP.h>
#include <lib/LoRa.h>
#include <SSD1306.h>
#include <EEPROM.h>
#include <main.h>
#include <targets.h>
#include <pixel.h>
#include <math.h>
#include <cmath>
#include "BluetoothSerial.h"

#define M_PI 3.14159265358979323846

// -------- VARS

config_t cfg;
system_t sys;
stats_t stats;
MSP msp;
msp_radar_pos_t radarPos;
curr_t curr;
peer_t peers[LORA_NODES_MAX];
air_type0_t air_0;

char host_name[3][5]={"NoFC", "GCS", "INAV"};
char host_state[2][4]={"", "ARM"};
char peer_slotname[9][2]={"X", "A", "B", "C", "D", "E", "F", "G", "H"};
char loramode_name[3][11]={"Standard", "Long range", "Fast"};
String bt_message = "";
char bt_incoming;

SSD1306 display(OLED_ADDRESS, OLED_SDA, OLED_SCL);
BluetoothSerial SerialBT;

// -------- EEPROM / CONFIG

void config_save() {
    for(size_t i = 0; i < sizeof(cfg); i++) {
        char data = ((char *)&cfg)[i];
        EEPROM.write(i, data);
    }
    EEPROM.commit();
}

void config_init(bool forcedefault = 0) {

    size_t size = sizeof(cfg);
    EEPROM.begin(size * 2);

    for(size_t i = 0; i < size; i++)  {
        char data = EEPROM.read(i);
        ((char *)&cfg)[i] = data;
    }

    if (cfg.version != VERSION_CONFIG || FORCE_DEFAULT_CONFIG || forcedefault)
        {
        cfg.version = VERSION_CONFIG;
        strcpy(cfg.target_name, CFG_TARGET_NAME);
        cfg.lora_power = LORA_POWER;
        cfg.lora_band = LORA_BAND;
        cfg.lora_frequency = LORA_FREQUENCY_433;
        cfg.lora_mode = LORA_MODE;

        cfg.lora_bandwidth = LORA_M0_BANDWIDTH;
        cfg.lora_coding_rate = LORA_M0_CODING_RATE;
        cfg.lora_spreading_factor = LORA_M0_SPREADING_FACTOR;
        cfg.lora_nodes = LORA_M0_NODES;
        cfg.lora_slot_spacing = LORA_M0_SLOT_SPACING;
        cfg.lora_timing_delay = LORA_M0_TIMING_DELAY;
        cfg.msp_after_tx_delay = LORA_M0_MSP_AFTER_TX_DELAY;

        cfg.display_enable = 1;
        config_save();
    }
}

// -------- SYSTEM

int count_peers(bool active = 0) {
    int j = 0;
    for (int i = 0; i < cfg.lora_nodes; i++) {
        if (active == 1) {
            if ((peers[i].id > 0) && peers[i].lost == 0) {
                j++;
            }
        }
        else {
            if (peers[i].id > 0) {
                j++;
            }
        }
    }
    return j;
}

void reset_peers() {
    sys.now_sec = millis();
    for (int i = 0; i < cfg.lora_nodes; i++) {
        peers[i].id = 0;
        peers[i].host = 0;
        peers[i].state = 0;
        peers[i].lost = 0;
        peers[i].broadcast = 0;
        peers[i].lq_updated = sys.now_sec;
        peers[i].lq_tick = 0;
        peers[i].lq = 0;
        peers[i].updated = 0;
        peers[i].rssi = 0;
        peers[i].distance = 0;
        peers[i].direction = 0;
        peers[i].relalt = 0;
        strcpy(peers[i].name, "");
    }
}

void pick_id() {
    curr.id = 0;
    for (int i = 0; i < cfg.lora_nodes; i++) {
        if ((peers[i].id == 0) && (curr.id == 0)) {
            curr.id = i + 1;
        }
    }
}

void resync_tx_slot(int16_t delay) {
    bool startnow = 0;
    for (int i = 0; (i < cfg.lora_nodes) && (startnow == 0); i++) {
        if (peers[i].id > 0) {
            sys.lora_next_tx = peers[i].updated + (curr.id - peers[i].id) * cfg.lora_slot_spacing + sys.lora_cycle + delay;
            startnow = 1;
        }
    }
}

// ----------------------------------------------------------------------------- calc gps distance

double deg2rad(double deg) {
    return (deg * M_PI / 180);
}

double rad2deg(double rad) {
    return (rad * 180 / M_PI);
}

double gpsDistanceBetween(double lat1d, double lon1d, double lat2d, double lon2d) {
    double lat1r, lon1r, lat2r, lon2r, u, v;
    lat1r = deg2rad(lat1d);
    lon1r = deg2rad(lon1d);
    lat2r = deg2rad(lat2d);
    lon2r = deg2rad(lon2d);
    u = sin((lat2r - lat1r)/2);
    v = sin((lon2r - lon1r)/2);
    return 2.0 * 6371000 * asin(sqrt(u * u + cos(lat1r) * cos(lat2r) * v * v));
}

double gpsCourseTo(double lat1, double long1, double lat2, double long2) {
    // returns course in degrees (North=0, West=270) from position 1 to position 2,
    // both specified as signed decimal-degrees latitude and longitude.
    double dlon = radians(long2-long1);
    lat1 = radians(lat1);
    lat2 = radians(lat2);
    double a1 = sin(dlon) * cos(lat2);
    double a2 = sin(lat1) * cos(lat2) * cos(dlon);
    a2 = cos(lat1) * sin(lat2) - a2;
    a2 = atan2(a1, a2);
    if (a2 < 0.0) {
        a2 += TWO_PI;
    }
return degrees(a2);
}

// -------- LoRa

void lora_send() {

    air_0.id = curr.id;
    air_0.lat = curr.gps.lat / 100;
    air_0.lon = curr.gps.lon / 100;
    air_0.alt = curr.gps.alt; // m
    air_0.extra_type = sys.lora_tick % 5;

    switch (air_0.extra_type)
        {
        case 0 : air_0.extra_value = curr.gps.groundCourse / 10;
        break;

        case 1 : air_0.extra_value = curr.gps.groundSpeed / 20;
        break;

        case 2 : air_0.extra_value = curr.name[0];
        break;

        case 3 : air_0.extra_value = curr.name[1];
        break;

        case 4 : air_0.extra_value = curr.name[2];
        break;

        default:
        break;
        }

    while (!LoRa.beginPacket()) {  } // --------------------------- Implicit len
    LoRa.write((uint8_t*)&air_0, sizeof(air_0));
    LoRa.endPacket(false);
}

void lora_receive(int packetSize) {

    if (packetSize == 0) return;

    sys.lora_last_rx = millis();
    sys.lora_last_rx -= (stats.last_tx_duration > 0 ) ? stats.last_tx_duration : 0; // RX time is the same as TX time
    sys.last_rssi = LoRa.packetRssi();
    sys.ppsc++;

    LoRa.readBytes((uint8_t *)&air_0, packetSize);

    uint8_t id = air_0.id - 1;

    peers[id].gps_pre.lat = peers[id].gps.lat;
    peers[id].gps_pre.lon = peers[id].gps.lon;
    peers[id].gps_pre.alt = peers[id].gps.alt;
    peers[id].gps_pre.groundCourse = peers[id].gps.groundCourse;
    peers[id].gps_pre.groundSpeed = peers[id].gps.groundSpeed;
    peers[id].gps_pre_updated = peers[id].updated;

    sys.air_last_received_id = air_0.id;
    peers[id].id = sys.air_last_received_id;
    peers[id].lq_tick++;
    peers[id].state = 0;
    peers[id].lost = 0;
    peers[id].updated = sys.lora_last_rx;
    peers[id].rssi = sys.last_rssi;

    peers[id].gps.lat = air_0.lat * 100;
    peers[id].gps.lon = air_0.lon * 100;
    peers[id].gps.alt = air_0.alt; // m

    switch (air_0.extra_type)
        {
        case 0 : peers[id].gps.groundCourse = air_0.extra_value * 10;
        break;

        case 1 : peers[id].gps.groundSpeed = air_0.extra_value * 20;
        break;

        case 2 : peers[id].name[0] = air_0.extra_value;
        break;

        case 3 : peers[id].name[1] = air_0.extra_value;
        break;

        case 4 : peers[id].name[2] = air_0.extra_value;
                 peers[id].name[3] = 0;
        break;

        default:
        break;
        }

