OlivierC-FR/ESP32-INAV-Radar/src/main.cpp
const byte interruptPin = 0;
volatile int interruptCounter = 0;
int numberOfInterrupts = 0;

portMUX_TYPE mux = portMUX_INITIALIZER_UNLOCKED;

void IRAM_ATTR handleInterrupt() {
    portENTER_CRITICAL_ISR(&mux);

    if (sys.io_button_pressed == 0) {
        sys.io_button_pressed = 1;

        if (sys.phase > MODE_LORA_SYNC) {
            sys.display_page++;
        }
        else if (sys.phase == MODE_HOST_SCAN || sys.phase == MODE_LORA_SCAN)  {
            sys.io_bt_enabled = 1; // Enable the Bluetooth if button pressed during host scan or lora scan
        }
        else if (sys.phase == MODE_START) {
            for (int i = 0; i < 512; i++) { EEPROM.write(i, 0); }
            EEPROM.commit();
            delay(500);
        }
        sys.io_button_released = millis();
    }
    portEXIT_CRITICAL_ISR(&mux);
}

// ----------------------------- setup

void setup() {

    sys.phase = MODE_START;
    sys.forcereset = 0;
    sys.io_bt_enabled = CFG_AUTOSTART_BT;
    sys.debug = 0;

    config_init();

    sys.lora_cycle = cfg.lora_nodes * cfg.lora_slot_spacing;
    sys.cycle_stats = sys.lora_cycle * 2;

    pinMode(IO_LED_PIN, OUTPUT);
    sys.io_led_blink = 0;

    pinMode(interruptPin, INPUT);
    sys.io_button_pressed = 0;
    attachInterrupt(digitalPinToInterrupt(interruptPin), handleInterrupt, RISING);

    if (cfg.display_enable) {
        display_init();
        display.clear();
        display.setFont(ArialMT_Plain_16);
        display.setTextAlignment(TEXT_ALIGN_LEFT);
        display.drawString(0,0, "ESP32");
        display.drawString(0,17, "RADAR");
        display.setTextAlignment(TEXT_ALIGN_RIGHT);
        display.drawString(127, 0, String(VERSION));
        display.setTextAlignment(TEXT_ALIGN_LEFT);
        display.setFont(ArialMT_Plain_10);
        display.drawString (0, 52, "Press for full reset");
        display.display();
    }

    delay(START_DELAY);

    msp.begin(Serial1);
    Serial1.begin(SERIAL_SPEED, SERIAL_8N1, SERIAL_PIN_RX , SERIAL_PIN_TX);
    reset_peers();

    lora_init();

    if (cfg.display_enable) {
        display.clear();
        display.setFont(ArialMT_Plain_10);
        display.drawString(0, 52, "Press to start BT config");
        display.setTextAlignment(TEXT_ALIGN_RIGHT);
        display.setTextAlignment(TEXT_ALIGN_LEFT);
        display.drawString(0, 9, String(cfg.target_name));
        display.drawString(35, 9, String(cfg.lora_band) + "MHz");
        display.drawString(0, 19, "MODE:");
        display.drawString(35, 19, String(loramode_name[cfg.lora_mode]));
        display.drawString(0, 29, "HOST:");
        display.display();
    }

    sys.cycle_scan_begin = millis();
    sys.now = millis();
    curr.host = HOST_NONE;
    sys.phase = MODE_HOST_SCAN;
}

// ----------------------------------------------------------------------------- MAIN LOOP

void loop() {

sys.now = millis();

// ---------------------- IO BUTTON

if ((sys.now > sys.io_button_released + 150) && (sys.io_button_pressed == 1)) {
    sys.io_button_pressed = 0;
}

// ---------------------- HOST SCAN

if (sys.phase == MODE_HOST_SCAN) {

    if ((sys.now > (sys.cycle_scan_begin + HOST_MSP_TIMEOUT)) || (curr.host != HOST_NONE)) {  // End of the host scan
        if (curr.host != HOST_NONE) {
            msp_get_name();
        }

        if (curr.name[0] == '\0') {
            for (int i = 0; i < 3; i++) {
                curr.name[i] = (char) random(65, 90);
            }
        curr.name[3] = 0;
        }

        curr.gps.fixType = 0;
        curr.gps.lat = 0;
        curr.gps.lon = 0;
        curr.gps.alt = 0;
        curr.id = 0;

        LoRa.sleep();
        LoRa.receive();

        if (cfg.display_enable) {
            if (curr.host != HOST_NONE) {
                display.drawString (35, 29, String(host_name[curr.host]) + " " + String(curr.fcversion.versionMajor) + "."  + String(curr.fcversion.versionMinor) + "." + String(curr.fcversion.versionPatchLevel));
            } else {
                display.drawString (35, 29, String(host_name[curr.host]));
            }
            if (sys.io_bt_enabled) {
                display.drawString (105, 29, "+BT");
            }
            display.drawProgressBar(0, 0, 63, 6, 100);
            display.drawString (0, 39, "SCAN:");
            display.display();
        }

        sys.cycle_scan_begin = millis();
        sys.phase = MODE_LORA_SCAN;

    }
    else { // Still scanning
        if (sys.now > sys.display_updated + DISPLAY_CYCLE / 2) {
            delay(100);
            msp_set_fc();

            if (cfg.display_enable) {
                display.drawProgressBar(0, 0, 63, 6, 100 * (millis() - sys.cycle_scan_begin) / HOST_MSP_TIMEOUT);
                display.display();
            }
            sys.display_updated = millis();
        }
    }
}

// ---------------------- LORA INIT

if (sys.phase == MODE_LORA_SCAN) {

    if (sys.now > (sys.cycle_scan_begin + LORA_CYCLE_SCAN)) {  // End of the scan, set the ID then sync

        if(sys.io_bt_enabled) {
            SerialBT.begin((String)"ESP32");
        }

        sys.num_peers = count_peers();
        if (sys.num_peers >= cfg.lora_nodes || curr.host == HOST_GCS) { // Too many nodes already, or connected to a ground station : go silent mode
            sys.lora_no_tx = 1;
        }
        else {
            sys.lora_no_tx = 0;
            pick_id();
        }
        sys.display_page = 0;
        sys.phase = MODE_LORA_SYNC;
    }
    else { // Still scanning

        if (sys.now > sys.display_updated + DISPLAY_CYCLE / 2 && cfg.display_enable) {
            for (int i = 0; i < cfg.lora_nodes; i++) {
                if (peers[i].id > 0) {
                    display.drawString(28 + peers[i].id * 8, 39, String(peer_slotname[peers[i].id]));
                }
            }
            display.drawProgressBar(64, 0, 63, 6, 100 * (millis() - sys.cycle_scan_begin) / LORA_CYCLE_SCAN);
            display.display();
            sys.display_updated = millis();
        }
    delay(20);
    }
}

// ---------------------- LORA SYNC

if (sys.phase == MODE_LORA_SYNC) {

    if (sys.num_peers == 0 || sys.lora_no_tx) { // Alone or Silent mode, no need to sync
        sys.lora_next_tx = millis() + sys.lora_cycle;
        }
    else { // Not alone, sync by slot
        resync_tx_slot(cfg.lora_timing_delay);
    }

    sys.display_updated = sys.lora_next_tx + sys.lora_cycle - 30;
    sys.stats_updated = sys.lora_next_tx + sys.lora_cycle - 15;
    sys.pps = 0;
    sys.ppsc = 0;
    sys.num_peers = 0;
    stats.packets_total = 0;
    stats.packets_received = 0;
    stats.percent_received = 0;
    digitalWrite(IO_LED_PIN, LOW);
    sys.phase = MODE_LORA_RX;
}

// ---------------------- LORA RX

