OlivierC-FR/ESP32-INAV-Radar/src/main.cpp
if ((sys.phase == MODE_LORA_RX) && (sys.now > sys.lora_next_tx)) {

    while (sys.now > sys.lora_next_tx) { // In  case we skipped some beats
        sys.lora_next_tx += sys.lora_cycle;
    }

    if (sys.lora_no_tx) {
        sprintf(sys.message, "%s", "SILENT MODE (NO TX)");
        }
    else {
        sys.phase = MODE_LORA_TX;
    }
    sys.lora_tick++;
}

// ---------------------- LORA TX

if (sys.phase == MODE_LORA_TX) {
    if (curr.host == HOST_NONE) {
        curr.gps.lat = 0;
        curr.gps.lon = 0;
        curr.gps.alt = 0;
        curr.gps.groundCourse = 0;
        curr.gps.groundSpeed = 0;
    }
    else if (curr.host == HOST_INAV) {
        msp_get_gps(); // GPS > FC > ESP
    }

    sys.lora_last_tx = millis();
    lora_send();
    stats.last_tx_duration = millis() - sys.lora_last_tx;

    // Drift correction

    if (curr.id > 1 && sys.num_peers_active > 0) {
        int prev = curr.id - 2;
        if (peers[prev].id > 0) {
            sys.lora_drift = sys.lora_last_tx - peers[prev].updated - cfg.lora_slot_spacing;

            if ((abs(sys.lora_drift) > LORA_DRIFT_THRESHOLD) && (abs(sys.lora_drift) < cfg.lora_slot_spacing)) {
                sys.drift_correction = constrain(sys.lora_drift, -LORA_DRIFT_CORRECTION, LORA_DRIFT_CORRECTION);
                sys.lora_next_tx -= sys.drift_correction;
                sprintf(sys.message, "%s %3d", "TIMING ADJUST", -sys.drift_correction);
            }
        }
    }

    sys.lora_slot = 0;
    sys.msp_next_cycle = sys.lora_last_tx + cfg.msp_after_tx_delay;

    // Back to RX

    LoRa.sleep();
    LoRa.receive();
    sys.phase = MODE_LORA_RX;
}

// ---------------------- DISPLAY

if ((sys.now > sys.display_updated + DISPLAY_CYCLE) && sys.display_enable && (sys.phase > MODE_LORA_SYNC) && cfg.display_enable) {
    stats.timer_begin = millis();

    if (sys.num_peers == 0 && sys.display_page == 1)  { // No need for timings graphs when alone
        sys.display_page++;
    }

    if (sys.display_page >= (3 + cfg.lora_nodes)) {
        sys.display_page = 0;
    }

    display_draw();
    sys.message[0] = 0;
    stats.last_oled_duration = millis() - stats.timer_begin;
    sys.display_updated = sys.now;
}

// ---------------------- SERIAL / MSP

if (sys.now > sys.msp_next_cycle && curr.host != HOST_NONE && sys.phase > MODE_LORA_SYNC && sys.lora_slot < cfg.lora_nodes) {
    stats.timer_begin = millis();

    if (sys.lora_slot == 0 && curr.host == HOST_INAV) {

        if (sys.lora_tick % 6 == 0) {
            msp_get_state();
        }

        if ((sys.lora_tick + 1) % 6 == 0) {
            msp_get_fcanalog();
        }

    }

// msp_send_peer(sys.lora_slot);

// ----------------Send MSP to FC and predict new position for all nodes minus current

    for (int i = 0; i < cfg.lora_nodes; i++) {
        if (peers[i].id > 0 && i+1 != curr.id ) {
            peers[i].gps_comp.lat = peers[i].gps.lat;
            peers[i].gps_comp.lon = peers[i].gps.lon;
            peers[i].gps_comp.alt = peers[i].gps.alt;

            if (peers[i].gps.groundSpeed > 200 && peers[i].gps.lat != 0 && peers[i].gps_pre.lat != 0) { // If speed >2m/s : Compensate the position delay
                    sys.now_sec = millis();
                    int32_t comp_var_lat = peers[i].gps.lat - peers[i].gps_pre.lat;
                    int32_t comp_var_lon = peers[i].gps.lon - peers[i].gps_pre.lon;
                    int32_t comp_var_alt = peers[i].gps.alt - peers[i].gps_pre.alt;
                    int32_t comp_var_dur = 1 + peers[i].updated - peers[i].gps_pre_updated;
                    int32_t comp_dur_fw = (sys.now_sec - peers[i].updated);
                    float comp_ratio = comp_dur_fw / comp_var_dur;

                    peers[i].gps_comp.lat += comp_var_lat * comp_ratio;
                    peers[i].gps_comp.lon += comp_var_lon * comp_ratio;
                    peers[i].gps_comp.alt += comp_var_alt * comp_ratio;
            }
            msp_send_radar(i);
            delay(7);
        }
    }
    stats.last_msp_duration[sys.lora_slot] = millis() - stats.timer_begin;
    sys.msp_next_cycle += cfg.lora_slot_spacing;
    sys.lora_slot++;
}

// ---------------------- SERIAL BLUETOOTH

if (sys.io_bt_enabled) {
    if (SerialBT.available()) {
        bt_incoming = SerialBT.read();

        if (bt_incoming != '\n') {
            bt_message += String(bt_incoming);
        }
        else {
            bt_message = "";
        }

        Serial.write(bt_incoming);
    }

    if (bt_message) {
        if (bt_message=="reboot") {
            SerialBT.println("Rebooting");
            delay(1000);
            ESP.restart();
        }
        else if (bt_message=="reset") {
            SerialBT.println("Resetting to default values");
            config_init(1);
            SerialBT.println("Rebooting");
            delay(1000);
            ESP.restart();
        }
        else if (bt_message=="cmd") {
            SerialBT.println("------------");
            SerialBT.println("info : Configuration infos");
            SerialBT.println("band433 : Radio module is 433MHz");
            SerialBT.println("band858 : Radio module is 858MHz");
            SerialBT.println("band915 : Radio module is 915MHz");
            SerialBT.println("mode0 : Lora mode " + (String)loramode_name[0]);
            SerialBT.println("mode1 : Lora mode " + (String)loramode_name[1]);
            SerialBT.println("mode2 : Lora mode " + (String)loramode_name[2]);
            SerialBT.println("debug : Toggle debug mode on/off");
            SerialBT.println("list : List active nodes");
            SerialBT.println("reset : Reset all values to default");
            SerialBT.println("reboot : Restarts the ESP");
            SerialBT.println("------------");
        }
        else if (bt_message=="band433") {
            SerialBT.println("Setting band : 433MHz");
            SerialBT.println("Active after reboot");
            cfg.lora_band = 433;
            cfg.lora_frequency = 433375000;
            config_save();
        }
        else if (bt_message=="band868") {
            SerialBT.println("Setting band : 868MHz");
            SerialBT.println("Active after reboot");
            cfg.lora_band = 868;
            cfg.lora_frequency = 868500000;
            config_save();
        }
        else if (bt_message=="band915") {
            SerialBT.println("Setting band : 915MHz");
            SerialBT.println("Active after reboot");
            cfg.lora_band = 915;
            cfg.lora_frequency = 915000000;
            config_save();
        }
        else if (bt_message=="mode0") {
            SerialBT.println("Setting radio mode : " + (String)loramode_name[0]);
            cfg.lora_mode = 0;
            cfg.lora_bandwidth = LORA_M0_BANDWIDTH;
            cfg.lora_coding_rate = LORA_M0_CODING_RATE;
            cfg.lora_spreading_factor = LORA_M0_SPREADING_FACTOR;
            cfg.lora_nodes = LORA_M0_NODES;
            cfg.lora_slot_spacing = LORA_M0_SLOT_SPACING;
            cfg.lora_timing_delay = LORA_M0_TIMING_DELAY;
            cfg.msp_after_tx_delay = LORA_M0_MSP_AFTER_TX_DELAY;
            SerialBT.println((String)cfg.lora_nodes + " nodes x " + (String)cfg.lora_slot_spacing + "ms = " + (String)(cfg.lora_nodes * cfg.lora_slot_spacing) + "ms cycle");
            SerialBT.println("Active after reboot");
            config_save();
        }
        else if (bt_message=="mode1") {
            SerialBT.println("Setting radio mode : " + (String)loramode_name[1]);
            cfg.lora_mode = 1;
            cfg.lora_bandwidth = LORA_M1_BANDWIDTH;
            cfg.lora_coding_rate = LORA_M1_CODING_RATE;
            cfg.lora_spreading_factor = LORA_M1_SPREADING_FACTOR;
            cfg.lora_nodes = LORA_M1_NODES;
            cfg.lora_slot_spacing = LORA_M1_SLOT_SPACING;
            cfg.lora_timing_delay = LORA_M1_TIMING_DELAY;
            cfg.msp_after_tx_delay = LORA_M1_MSP_AFTER_TX_DELAY;
            SerialBT.println((String)cfg.lora_nodes + " nodes x " + (String)cfg.lora_slot_spacing + "ms = " + (String)(cfg.lora_nodes * cfg.lora_slot_spacing) + "ms cycle");
            SerialBT.println("Active after reboot");
            config_save();
        }
        else if (bt_message=="mode2") {
            SerialBT.println("Setting radio mode : " + (String)loramode_name[2]);
            cfg.lora_mode = 2;
            cfg.lora_bandwidth = LORA_M2_BANDWIDTH;
            cfg.lora_coding_rate = LORA_M2_CODING_RATE;
            cfg.lora_spreading_factor = LORA_M2_SPREADING_FACTOR;
            cfg.lora_nodes = LORA_M2_NODES;
            cfg.lora_slot_spacing = LORA_M2_SLOT_SPACING;
            cfg.lora_timing_delay = LORA_M2_TIMING_DELAY;
            cfg.msp_after_tx_delay = LORA_M2_MSP_AFTER_TX_DELAY;
            SerialBT.println((String)cfg.lora_nodes + " nodes x " + (String)cfg.lora_slot_spacing + "ms = " + (String)(cfg.lora_nodes * cfg.lora_slot_spacing) + "ms cycle");
            SerialBT.println("Active after reboot");
            config_save();
        }
        else if (bt_message=="debug") {
            if (sys.debug) { sys.debug = 0; }
            else { sys.debug = 1;}
        }
        else if (bt_message=="6nodes") {
            SerialBT.println("Setting 6 nodes max");
            SerialBT.println("Active after reboot");
            cfg.lora_nodes = 6;
            config_save();
        }
        else if (bt_message=="info") {
            SerialBT.println("ESP32 Radar version: " + String(cfg.version));
            SerialBT.println("Target: " + String(cfg.target_name) + " " + String(CFG_TARGET_FULLNAME));
            SerialBT.println("Band: " + String(cfg.lora_band)+ "MHz / Mode: " + String(loramode_name[cfg.lora_mode]));
            SerialBT.println("Freq: " + String((float)cfg.lora_frequency / 1000000, 3)+ "MHz / Power: " + String(cfg.lora_power));
            SerialBT.println("BW: " + String((float)cfg.lora_bandwidth / 1000, 0)+ "KHz / CR: " + String(cfg.lora_coding_rate) + " / SF: " +String(cfg.lora_spreading_factor));
            SerialBT.println((String)cfg.lora_nodes + " nodes x " + (String)cfg.lora_slot_spacing + "ms = " + (String)(cfg.lora_nodes * cfg.lora_slot_spacing) + "ms cycle");
        }
        else if (bt_message=="list") {
            for (int i = 0; i < cfg.lora_nodes; i++) {
                if (peers[i].id > 0) {
                    SerialBT.println((String)"[" + char(i+65) + "] " + peers[i].name + " N" + String((float)peers[i].gps_rec.lat / 10000000, 5) + " E" + String((float)peers[i].gps_rec.lon / 10000000, 5) + " " + peers[i].gps_rec.alt + "m " + String(peers[i].gps.groundSpeed / 100) + "m/s " + String(peers[i].gps.groundCourse / 10) + "° " + String((int)((sys.lora_last_tx - peers[i].updated) / 1000)) + "s " + String(peers[i].rssi) + "db");
                }
                if (i + 1 == curr.id) {
                    SerialBT.println((String)"[" + char(i+65) + "] " + String(host_name[curr.host]) + " (host) N" + String((float)curr.gps.lat / 10000000, 5) + " E" + String((float)curr.gps.lon / 10000000, 5) + " " + String(curr.gps.alt) + "m Eff:" + String(stats.percent_received) + "%" );
                }
            }
        }
    }
}

