OlivierC-FR/ESP32-INAV-Radar/src/main.cpp
// ---------------------- STATISTICS & IO

if ((sys.now > (sys.cycle_stats + sys.stats_updated)) && (sys.phase > MODE_LORA_SYNC)) {
    sys.pps = sys.ppsc;
    sys.ppsc = 0;
    // sys.last_snr = LoRa.packetSnr();
    // sys.last_freqerror = LoRa.packetFrequencyError();

    // Timed-out peers + LQ

    for (int i = 0; i < cfg.lora_nodes; i++) {
        if (sys.now > (peers[i].lq_updated +  sys.lora_cycle * 4)) {
            uint16_t diff = peers[i].updated - peers[i].lq_updated;
            peers[i].lq = constrain(peers[i].lq_tick * 4.2 * sys.lora_cycle / diff, 0, 4);
            peers[i].lq_updated = sys.now;
            peers[i].lq_tick = 0;
        }
        if (peers[i].id > 0 && ((sys.now - peers[i].updated) > LORA_PEER_TIMEOUT)) { // Lost for a short time
            peers[i].lost = 1;
            if ((sys.now - peers[i].updated) > LORA_PEER_TIMEOUT_LOST) { // Lost for a long time
                peers[i].lost = 2;
            }
        }
    }

    sys.num_peers_active = count_peers(1);
    stats.packets_total += sys.num_peers_active * sys.cycle_stats / sys.lora_cycle;
    stats.packets_received += sys.pps;
    stats.percent_received = (stats.packets_received > 0) ? constrain(100 * stats.packets_received / stats.packets_total, 0 ,100) : 0;

    // Screen management

    if (!curr.state && !sys.display_enable) { // Aircraft is disarmed = Turning on the OLED
        display.displayOn();
        sys.display_enable = 1;
    }
    else if (curr.state && sys.display_enable) { // Aircraft is armed = Turning off the OLED
        display.displayOff();
        sys.display_enable = 0;
    }
    sys.stats_updated = sys.now;
}

// ---------------------- LED blinker

if (sys.lora_tick % 6 == 0) {
    if (sys.num_peers_active > 0) {
        sys.io_led_changestate = millis() + IO_LEDBLINK_DURATION;
        sys.io_led_count = 0;
        sys.io_led_blink = 1;
    }
}

if (sys.io_led_blink && millis() > sys.io_led_changestate) {

    sys.io_led_count++;
    sys.io_led_changestate += IO_LEDBLINK_DURATION;

    if (sys.io_led_count % 2 == 0) {
        digitalWrite(IO_LED_PIN, LOW);
    }
    else {
        digitalWrite(IO_LED_PIN, HIGH);
    }

    if (sys.io_led_count >= sys.num_peers_active * 2) {
        sys.io_led_blink = 0;
    }

}

} // -----